Tekla Open API Reference for Tekla Structures 2025
RebarSpacing.Offset.Automatic Field
 Defines whether the offset distance is to be automatically calculated.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Automatic
Public Automatic As Boolean
Field Value
Type: Boolean
See Also
Reference
RebarSpacing.Offset Structure
Tekla.Structures.Model Namespace